TestPlans/Home/Legal & General Essentials/xml/LGE3_08122014_13.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ssp="http://SSP.Authentication.Services/" xmlns:tem="http://WebServices.ssp-uk.com/HouseholdAggregator/">
  <soap:Header>
    <ssp:Security>
      <ssp:SystemUsername>1045678055</ssp:SystemUsername>
      <ssp:SystemPassword>AE9ACEEC-D1CA-4BF9-8318-66C61EF5B74F</ssp:SystemPassword>
      <ssp:SystemID>2</ssp:SystemID>
    </ssp:Security>
  </soap:Header>
  <soap:Body>
    <tem:GetQuote>
      <tem:quote CoverStart="2014-12-08" CoverStartTime="00:00:00" IsMultiProposer="true" CoverType="ContentsAndBuildings" PaymentFrequency="U" PaymentFrequencyDescription="Unknown">
        <SingleQuoteRequest QuoteMultipleBroker="true" BrokerSCIDs="C00057-001,C00057-002" />
        <Proposer ProposerType="MainProposer" RelationshipToProposer="P" DateOfBirth="1972-04-17" Sex="Male" MaritalStatus="Separated" IsSmoker="false" FirstTimeBuyer="false" HasConvictions="false" HasCcj="false" HasPolicyRefused="false" DateResidencyStarted="2014-12-08" EmailAddress="michael.hudson@emailreaction.org" Title="Mr" FirstName="Matthew" LastName="Thirteen" DayTimePhone="01778852852">
          <Occupation IsFullTime="true" EmploymentStatus="Self-Employed" OccupationCode="214" BusinessCode="486" />
          <CorrespondenceAddress HouseName="" AddressLine1="1 London Road" AddressLine2="Osbournby" AddressLine3="Sleaford" AddressLine4="Lincolnshire" Postcode="NG34 0DG" />
        </Proposer>
        <Proposer ProposerType="CoProposer" RelationshipToProposer="B" DateOfBirth="1960-01-01" Sex="Female" MaritalStatus="Divorced" IsSmoker="false" FirstTimeBuyer="false" HasConvictions="false" HasCcj="false" HasPolicyRefused="false" DateResidencyStarted="2014-12-08" Title="Mrs" FirstName="Joint" LastName="Policyholder">
          <Occupation IsFullTime="true" EmploymentStatus="Self-Employed" OccupationCode="C55" BusinessCode="818" />
        </Proposer>
        <Claim Cost="1000" IsCurrentAddress="false" Date="2010-01-01" ClaimType="36" CoverType="ContentsAndBuildings" />
        <Premises YearBuilt="1000" PremisesType="08" NumberOfBedrooms="2" NumberOfBathrooms="1" TotalNumberOfRooms="6" IsOccupiedNight="true" OccupancyStatus="HolidayHome" OwnerShipType="03" IsSoleOccupancy="true" ListedBuildingType="3" IsUsedForBusiness="false" IsClericalWorkOnly="false" SelfContainedAndLockable="false" MaxDaysUnoccupied="30" HasSmokeDetector="true" SecurityDeviceDiscountRequired="false" IsFurnished="true" OccupantsOver18="0" OccupantsUnder18="0" HasExteriorLighting="false" IsSecurityActivated="false" ConstructionWall="99" ConstructionRoof="99" RoofFlatPercentage="50" IsFreeFromFlooding="true" IsNearRiverBank="false" IsGoodStateOfRepair="true" IsSOMaintained="false" IsTreesVicinity="false" HasExtension="false" IsOccupiedDay="true" HasStandardAlarm="false" AlarmProfMaintained="" HasApprovedAlarm="" MemberOfNeighbourHoodWatch="true" HasSafeInstalled="true" HasApprovedLocks="true" MainDoorLockType="240" HasPatioDoors="true" PatioDoorLockType="240" HasOtherDoors="true" OtherDoorLockType="240" AccessibleWindowLocks="KeyOperatedLocks" IsFreeFromSubsidence="true" IsFreeFromUnderpinning="true">
          <Address HouseName="" AddressLine1="1 London Road" AddressLine2="Osbournby" AddressLine3="Sleaford" AddressLine4="Lincolnshire" Postcode="NG34 0DG" />
        </Premises>
        <CoverRequired>
          <Buildings RebuildingCost="100000" IsAccidentalDamageRequired="false" VoluntaryExcess="100" IsFullValue="true" />
          <Contents ValuablesSumInsured="4000" ContentsCoverType="NewForOld" IsAccidentalDamageRequired="false" VoluntaryExcess="100" IsFullReplacementValue="true" ValueMostExpensiveItem="4000" AllRisksRequired="false" PersonalEffectsSumInsured="0" TotalSumInsured="40000">
            <SpecifiedItems>
              <SpecifiedItem ItemType="S02" Description="Long jump skis" Value="2500" />
            </SpecifiedItems>
          </Contents>
        </CoverRequired>
      </tem:quote>
      <tem:sourceOfBusiness>CompareTheMarket</tem:sourceOfBusiness>
    </tem:GetQuote>
  </soap:Body>
</soap:Envelope>